const ap = new APlayer({
    container: document.getElementById('aplayer'),
    autoplay: true,
    theme: '#FADFA3',
    listFolded: true,
    listMaxHeight: '300px',
    mutex: true,
    loop: 'all',
    order: 'random',
    preload: 'auto',
    volume: 0.7,
    lrcType: 1,
    audio: [
        {
            name: '夜空中最亮的星',
            artist: '逃跑计划',
            url: 'http://music.163.com/song/media/outer/url?id=25706282.mp3',
            cover: 'http://p1.music.126.net/d541jx7SqoDzVkenhmtg6g==/19193074974743620.jpg',
            lrc: '[00:00.680]编曲：Giles Tully / 李赤\n[00:01.680]制作人：Giles Tully / 李赤\n[00:02.680]缩混：Giles Tully / Patrick Weyer-Brown / 姜北生\n[00:03.680]Engineered by Hyperbolic Productions (Patrick Weyer-Brown & Giles Tully)\n[00:04.680]Acoustic Guitar & Drum recorded by Hyperbolic Productions (Patrick Weyer-Brown) at YUM music\n[00:05.680]Guitar Bass Vocal recorded by Hyperbolic Productions (Patrick Weyer-Brown & Giles Tully)\n[00:06.680]其他录音：时俊峰 福达录音棚 / 姜北生 环球唱片录音棚 / 方岩 Funky Studio\n[00:07.680]人声和声：逃跑计划\n[00:08.680]女声和声：孙亮亮\n[00:09.680]弦乐制作：朱金泰\n[00:10.680]弦乐编写：朱金泰 / 陈迪\n[00:11.680]弦乐：中国国家交响乐团\n[00:12.680]首席小提琴：董智敏\n[00:13.680]录音棚：有沐录音棚 YUM Studio\n[00:14.680]弦乐录音：杨杰、郑昊杰\n[00:15.680]制作助理：哈斯瑚必来\n[00:16.680]母带处理：Patrick Weyer-Brown (FR) 法国SAE Paris 录音棚\n\n\n\n[00:17.680]夜空中最亮的星 能否听清 \n[00:26.230] 那仰望的人 心底的孤独和叹息 \n[00:35.650] 夜空中最亮的星 能否记起 \n[00:44.210] 曾与我同行 消失在风里的身影 \n[00:52.540] 我祈祷拥有一颗透明的心灵 \n[00:57.640]和会流泪的眼睛 \n[01:01.880] 给我再去相信的勇气 \n[01:06.400]越过谎言去拥抱你 \n[01:10.420] 每当我找不到存在的意义 \n[01:15.300] 每当我迷失在黑夜里 \n[01:20.160] 夜空中最亮的星 \n[01:24.270] 请指引我靠近你\n[01:37.880]夜空中最亮的星 是否知道 \n[01:46.450] 曾与我同行的身影 如今在哪里 \n[01:55.450] 夜空中最亮的星 是否在意 \n[02:03.950] 是等太阳升起 还是意外先来临 \n[02:12.370] 我宁愿所有痛苦都留在心里 \n[02:17.690] 也不愿忘记你的眼睛 \n[02:22.270] 给我再去相信的勇气 \n[02:26.400] 越过谎言去拥抱你 \n[02:30.350] 每当我找不到存在的意义 \n[02:35.270] 每当我迷失在黑夜里 \n[02:40.720] 夜空中最亮的星 请照亮我前行 \n[03:05.420]我祈祷拥有一颗透明的心灵 \n[03:10.870]和会流泪的眼睛 \n[03:15.930] 给我再去相信的勇气 \n[03:19.660]越过谎言去拥抱你 \n[03:23.600] 每当我找不到存在的意义 \n[03:28.760] 每当我迷失在黑夜里 \n[03:33.540] 夜空中最亮的星 \n[03:37.590]请照亮我前行 \n[03:50.890]夜空中最亮的星 能否听清 \n[03:59.810]那仰望的人 心底的孤独和叹息',
            theme: '#ebd0c2'
        },
        {
            name: '出卖',
            artist: '简弘亦',
            url: 'http://music.163.com/song/media/outer/url?id=406086090.mp3',
            cover: 'http://p1.music.126.net/FiZafE2FWKsw3kEcJCsHSw==/1380986606501842.jp',
            lrc: '[00:01.58]\n[00:07.62]你的多情出卖我的爱情赔了我的命\n[00:15.57]我卖了一个世界却换来灰烬\n[00:22.50]\n[00:23.79]你的绝情出卖所有爱情\n[00:28.84]好梦一下子清醒\n[00:32.17]\n[00:32.82]感情像个闹钟按一下就停\n[00:39.35]\n[00:42.08]那么多年自作聪明付出了真心\n[00:47.95]\n[00:48.54]总以为换到一个公平的回应\n[00:55.00]\n[00:58.54]你床边的蜷曲头发残酷地说明\n[01:04.94]缠绵的爱比不上一时的高兴\n[01:13.45]你的多情出卖我的爱情赔了我的命\n[01:21.69]我卖了一个世界却换来灰烬\n[01:29.98]你的绝情出卖所有爱情\n[01:34.96]好梦一下子清醒\n[01:38.77]感情像个闹钟按一下就停\n[01:44.77]\n[01:48.10]那么多年得意忘形闭起了眼睛\n[01:54.17]\n[01:55.01]却看到这样血肉模糊的风景\n[02:01.41]\n[02:03.27]你的绝情出卖所有爱情\n[02:08.18]好梦一下子清醒\n[02:11.99]感情像个闹钟按一下就停',
            theme: '#46718b'
        },
        {
            name: '温柔',
            artist: '五月天',
            url: 'http://music.163.com/song/media/outer/url?id=386001.mp3',
            cover: 'http://p2.music.126.net/_B1Fn_Z1WxHzqGLzLZDf-w==/109951163263882447.jpg',
            lrc: '[00:09.300] \n[00:15.620]走在风中今天阳光 突然好温柔\n[00:22.930]天的温柔地的温柔 像你抱着我\n[00:30.200]然后发现你的改变 孤单的今后\n[00:36.500]如果冷 该怎么 渡过\n[00:43.800] \n[00:48.170]天边风光身边的我 都不在你眼中\n[00:55.210]你的眼中藏着什么 我从来都不懂\n[01:02.270]没有关系你的世界 就让你拥有\n[01:08.450]不打扰 是我的 温柔\n[01:15.620] \n[01:19.450]不知道不明了不想要为什么 我的心\n[01:26.670]明明是想靠近 却孤单到黎明\n[01:33.640]不知道不明了不想要为什么 我的心\n[01:40.860]那爱情的绮丽 总是在孤单里\n[01:47.840]再把我的最好的爱给你\n[01:55.340]不知不觉不情不愿 又到巷子口\n[02:02.370]我没有哭也没有笑 因为这是梦\n[02:09.260]没有预兆没有理由 你真的有说过\n[02:15.430]如果有 就让你自由\n[02:22.770] \n[02:32.940]我给你自由 我给你自由\n[02:39.700]我给你自由 我给你自由\n[02:43.120]我给你全部全部全部 全部自由\n[02:54.030]喔…\n[03:00.840]喔…\n[03:07.680]喔…\n[03:15.830] \n[03:55.730]这是我的温柔 这是我的温柔\n[03:59.110]让你立刻自由 让你立刻的自由\n[04:02.570]喔…\n[04:08.540]不知道不明了不想要为什么 我的心\n[04:15.460]明明是想靠近 却孤单到黎明\n[04:22.120]不知道不明了不想要为什么 我的心\n[04:29.090]那爱情的绮丽 总是在孤单里\n[04:35.800]再把我的最好的爱给你\n[04:43.260]不知不觉不情不愿 又到巷子口\n[04:50.070]我没有哭也没有笑 因为这是梦\n[04:56.890]没有预兆没有理由 你真的有说过\n[05:02.890]如果有 就让你\n[05:11.510]自由\n[05:18.190]自由\n[05:23.670]这是我的温柔 这是我的温柔\n[05:30.510]这是我的温柔 这是我的\n[05:38.610]温柔\n[05:49.610]就让你自由\n[05:59.640]喔…\n[06:06.670]',
            theme: '#FF9933'
        },
        {
            name: '再见再见',
            artist: '逃跑计划',
            url: 'http://music.163.com/song/media/outer/url?id=25706285.mp3',
            cover: 'http://p1.music.126.net/d541jx7SqoDzVkenhmtg6g==/19193074974743620.jpg',
            lrc: '[00:16.760] 汽车声打破宁静\n[00:22.230] 听得见却看不清\n[00:33.240] 路灯下我的身影\n[00:38.430] 是最短的距离\n[00:44.670] 最亲密\n[00:47.890] \n[00:49.950] 汽车声打破宁静\n[00:55.270] 听得见却看不清,突然安静\n[01:06.450] 路灯下我的身影\n[01:11.800] 是最短的距离\n[01:18.000] 最亲密\n[01:22.630] 我已用尽全身力气\n[01:27.000] 依然不在一个世界里\n[01:31.230] oh~那么让我最后握紧你的手\n[01:37.740] 一起说\n[01:38.639] 再见再见再见再见再见再见再见\n[01:44.250] 一百遍\n[01:46.350] 如果永远都不再见\n[01:53.600] 再见再见再见再见再见再见再见\n[01:59.460] 一万遍\n[02:01.380] 如果永远都不再见\n[02:08.799]\n[02:17.690] 请转过去保持安静\n[02:23.280] 不要看我眼睛\n[02:29.240] 不再透明\n[02:34.440] 路灯下你的身影\n[02:39.429] 是最远的距离\n[02:45.260] 永远的距离\n[02:50.300] 我已用尽全身力气\n[02:54.640] 依然无法阻止忘记\n[02:59.330] 那么让我最后握紧你的手\n[03:05.630] 一起说 再见再见再见再见再见再见再见\n[03:11.970] 一百遍\n[03:14.330] 如果永远都不再见\n[03:21.480] 再见再见再见再见再见再见再见\n[03:27.240] 一万遍\n[03:29.250] 如果永远都不再见\n[03:36.520] 再见再见再见再见再见再见再见\n[03:42.000] 一百遍\n[03:44.290] 如果永远都不再见\n[03:51.540] 再见再见再见再见再见再见再见\n[03:57.030] 一万遍\n[03:59.280] 如果永远都不再见\n[04:06.440] 再见再见再见再见再见再见再见\n[04:12.090] 一百遍\n[04:14.900] 如果永远都不再见\n[04:21.640] 再见再见再见再见再见再见再见\n[04:27.400] 一百遍\n[04:29.010] 如果永远都不再见\n[04:36.530] 再见再见再见再见再见再见再见\n[04:42.360] 一万遍\n[04:44.310] 如果永远都不再见\n[04:51.470] 再见再见再见再见再见再见再见\n[04:57.350] 一百遍\n[04:59.330] 如果永远都不再见\n[05:06.870] -end-',
            theme: '#336666'
        },
         {
            name: 'Promise',
            artist: '山岡晃',
            url: 'http://music.163.com/song/media/outer/url?id=18861490.mp3',
            cover: 'http://p1.music.126.net/QbadLxlMMmb4iStV4JnKLA==/6664139976590904.jpg',
            theme: '#663300'
        }

    ]
});